{
    "qAndAnswers": [
        {
            "question":"I transferred schools last semester and I still dont have many friends on campus, how do I meet more people?",
            "datePosted":"2023-01-24",
            "postedBy":"Tom",
            "questionResponses": [
                {
                    "dateRespoonse":"2023-01-24",
                    "qAnswerBy":"Dillon",
                    "qResponse":"I felt exactly the same way when I started school. I asked people in my class if they wanted to hangout and do groupwork together and that helped"
                },
                {
                    "dateRespoonse":"2023-01-25",
                    "qAnswerBy":"Jayne",
                    "qResponse":"Have you tried joining student clubs? I met a lot of friends that way. Dont worry, everyone feels like that!"
                }
            ]
        },
        {
            "question":"I feel like I keep falling behind in my classes.. how do I catch up?",
            "datePosted":"2023-01-18",
            "postedBy":"Dillon",
            "questionResponses": [
                {
                    "dateRespoonse":"2023-01-18",
                    "qAnswerBy":"Rick",
                    "qResponse":"Honestly you should talk to your professors. They might be able to move some deadlines and tell you what you really need to focus on vs whats less important."
                },
                {
                    "dateRespoonse":"2023-01-23",
                    "qAnswerBy":"Jayne",
                    "qResponse":"Dont worry! You got this!! I always feel like that, but at the end it always works out. Try making a list of priorities and start there!"
                },
                {
                    "dateRespoonse":"2023-01-27",
                    "qAnswerBy":"Tom",
                    "qResponse":"Dude, me too! Im still figuring it out but know you arent alone lol"
                },
            ]
        },
        {
            "question":"My family doesnt really think I should be wasting money going to school and should just start working. How do I tell them off?",
            "datePosted":"2023-02-01",
            "postedBy":"Tom",
            "questionResponses": [
                {
                    "dateRespoonse":"2023-02-01",
                    "qAnswerBy":"Taylor",
                    "qResponse":"Listen, you have to do whats right for YOU. Not everyones journey looks the same and thats totally okay. Sometimes family just doesnt get that."
                },
                {
                    "dateRespoonse":"2023-02-02",
                    "qAnswerBy":"Jayne",
                    "qResponse":"Im sorry your having a hard time with your fam, I know I wouldnt be where I am if I didnt go to school and I think it opens a lot of doors. Dont give up if its what you want to do."
                },
                {
                    "dateRespoonse":"2023-02-01",
                    "qAnswerBy":"Rick",
                    "qResponse":"My dad was the exact same way... I feel you man! I made sure they knew what i was working towards and why and kept them in the loop with how things were going and opportunities I had through school."
                }
            ]
        }
    ]
}